// дужки "()" - оператор вызова функции


// Интерфэйс - место взаимодействия между користувачем та системою

// Hello World! - мы не можем писать будь-что, это не будет выполнено браузером.
// Мы при програмировании постоянно должны придерживаться определенных правил


// - однострочный комент
/*
- многострочный комент

*/

// каждый тип данных по своему выделяеться в консоль.лог

console.log(true); // boolean
console.log(55); // number
console.log('text this'); // string
console.log(null);
console.log(undefined);
console.log(5n); // bigInt