// 1. () - оператор вызова функции
console.log();
// 2. () - для групування виразив. Можем указывать приритеты виконання арифметичных операций
const sum = (2+2)*6;
console.log(sum);

// екранування

// Задача: створити зминну с цитатой
const hello = 'Маша сказала: "Привет"'; // метод выришиння - разные типы лапок
//  одинарные ковычки - октрыть/закрыть строку
// двойные ковычки - для прямой мови
console.log(hello);

/* Екранування (escape) - когда мы використовуемо спец.символы або 
послидовности символив для вставки недопустимых символив в рядок */
//        \

const helloEscape = 'Маша сказала: \'Привет\''; // метод виришення - екранування
console.log(helloEscape); 

const test = 'Мне сегодня пришла зарплата, а тебе? \n- Мне тоже пришла, чудово!'; // \n - перенос строки
console.log(test);